ryankurte/efm32-base/emdrv/uartdrv/src/uartdrv.c
    // If we ran out of stretch on the clock division, error out.
    if (divisor > (_CMU_LFBPRESC0_LEUART0_MASK >> _CMU_LFBPRESC0_LEUART0_SHIFT)) {
      return ECODE_EMDRV_UARTDRV_CLOCK_ERROR;
    }
    CMU_ClockDivSet(handle->uartClock, (CMU_ClkDiv_TypeDef) (1 << divisor));
#elif defined(_SILICON_LABS_32B_SERIES_1)
    // Clock divider in LEUARTn is large enough for any baudrate.
#endif
  }

  CMU_ClockEnable(handle->uartClock, true);

  // Init LEUART to default async config.
  // Rx/Tx enable is done on demand
  leuartInit.enable = leuartDisable;
  LEUART_Init(initData->port, &leuartInit);

#if defined(LEUART_ROUTEPEN_TXPEN)
  initData->port->ROUTELOC0 = (initData->port->ROUTELOC0
                               & ~(_LEUART_ROUTELOC0_TXLOC_MASK
                                   | _LEUART_ROUTELOC0_RXLOC_MASK))
                              | (initData->portLocationTx
                                 << _LEUART_ROUTELOC0_TXLOC_SHIFT)
                              | (initData->portLocationRx
                                 << _LEUART_ROUTELOC0_RXLOC_SHIFT);

  initData->port->ROUTEPEN = LEUART_ROUTEPEN_TXPEN
                             | LEUART_ROUTEPEN_RXPEN;
#else
  initData->port->ROUTE = LEUART_ROUTE_TXPEN
                          | LEUART_ROUTE_RXPEN
                          | (initData->portLocation
                             << _LEUART_ROUTE_LOCATION_SHIFT);
#endif

  if ((retVal = SetupGpioLeuart(handle, initData)) != ECODE_EMDRV_UARTDRV_OK) {
    return retVal;
  }
  if ((retVal = ConfigGpio(handle, true)) != ECODE_EMDRV_UARTDRV_OK) {
    return retVal;
  }

  CORE_ENTER_ATOMIC();

  // Configure hardware flow control pins and interrupt vectors
#if (EMDRV_UARTDRV_FLOW_CONTROL_ENABLE)
  if (initData->fcType == uartdrvFlowControlHw) {
    InitializeGpioFlowControl(handle);
  }
#endif

  // Clear any false IRQ/DMA request
  LEUART_IntClear(initData->port, ~0x0);

  // Enable Tx permanently as the Tx circuit consumes very little energy.
  // Rx is enabled on demand as the Rx circuit consumes some energy due to
  // continuous (over)sampling.
  LEUART_Enable(initData->port, leuartEnableTx);

  // Wait for previous write (TXEN) to sync before clearing FIFOs
  while ((initData->port->SYNCBUSY & LEUART_SYNCBUSY_CMD) != 0U) {
  }

  // Discard false frames and/or IRQs
  initData->port->CMD = LEUART_CMD_CLEARRX | LEUART_CMD_CLEARTX;

  // Initialize DMA.
  retVal = InitializeDma(handle);

  CORE_EXIT_ATOMIC();

  if (retVal != ECODE_EMDRV_UARTDRV_OK) {
    return retVal;
  }

  // Wait for everything to be synchronized
  while (initData->port->SYNCBUSY != 0U) {
  }
  return ECODE_EMDRV_UARTDRV_OK;
}
#endif

#if defined(EUART_COUNT) && (EUART_COUNT > 0)
/***************************************************************************//**
 * @brief
 *    Initialize a EUART driver instance.
 *
 * @param[out] handle  Pointer to a UARTDRV handle, refer to @ref
 *                     UARTDRV_Handle_t.
 *
 * @param[in] initData Pointer to an initialization data structure,
 *                     refer to @ref UARTDRV_InitEuart_t.
 *
 * @return
 *    @ref ECODE_EMDRV_UARTDRV_OK on success. On failure an appropriate
 *    UARTDRV @ref Ecode_t is returned.
 ******************************************************************************/
Ecode_t UARTDRV_InitEuart(UARTDRV_Handle_t handle,
                          const UARTDRV_InitEuart_t *initData)
{
  Ecode_t retVal;
  CORE_DECLARE_IRQ_STATE;
  EUSART_Init_TypeDef uartInit = EUSART_INIT_DEFAULT_HF;
  EUSART_AdvancedInit_TypeDef uartAdvancedInit = EUSART_ADVANCED_INIT_DEFAULT;

  if (handle == NULL) {
    return ECODE_EMDRV_UARTDRV_ILLEGAL_HANDLE;
  }
  if (initData == NULL) {
    return ECODE_EMDRV_UARTDRV_PARAM_ERROR;
  }

  memset(handle, 0, sizeof(UARTDRV_HandleData_t));

  handle->peripheral.euart = initData->port;
  handle->type = uartdrvUartTypeEuart;
  handle->uartNum = initData->uartNum;

#if (EMDRV_UARTDRV_FLOW_CONTROL_ENABLE)
  retVal = SetHandleIndex(handle);
  if (retVal != ECODE_EMDRV_UARTDRV_OK) {
    return retVal;
  }
  handle->fcType = initData->fcType;
#else
  // Force init data to uartdrvFlowControlNone if flow control is excluded by EMDRV_UARTDRV_FLOW_CONTROL_ENABLE
  handle->fcType = uartdrvFlowControlNone;
#endif

  // Set clocks and DMA requests according to available peripherals
  if (false) {
#if defined(EUART0)
  } else if (initData->port == EUART0) {
    handle->uartClock   = cmuClock_EUART0;
    handle->txDmaSignal = dmadrvPeripheralSignal_EUART0_TXBL;
    handle->rxDmaSignal = dmadrvPeripheralSignal_EUART0_RXDATAV;
    uartAdvancedInit.dmaWakeUpOnRx = true;
    uartAdvancedInit.dmaWakeUpOnTx = true;
    handle->txDmaActive = false;
    handle->rxDmaActive = false;
#endif
  } else {
    return ECODE_EMDRV_UARTDRV_PARAM_ERROR;
  }

  InitializeQueues(handle, initData->rxQueue, initData->txQueue);

  // UARTDRV is fixed at 8 bit frames.
  uartInit.databits = (EUSART_Databits_TypeDef)eusartDataBits8;

  uartInit.baudrate = initData->baudRate;
  uartInit.stopbits = initData->stopBits;
  uartInit.parity = initData->parity;
  uartInit.oversampling = initData->oversampling;
  uartInit.majorityVote = initData->mvdis;

  uartInit.advancedSettings = &uartAdvancedInit;

  // Enable clocks.
  CMU_ClockEnable(cmuClock_GPIO, true);
  CMU_ClockEnable(handle->uartClock, true);
  if (initData->useLowFrequencyMode) {
    CMU_ClockEnable(cmuClock_LFRCO, true);
    CMU_ClockEnable(cmuClock_EM23GRPACLK, true);
    CMU_ClockSelectSet(cmuClock_EM23GRPACLK, cmuSelect_LFRCO);
    CMU_ClockSelectSet(handle->uartClock, cmuSelect_EM23GRPACLK);
  } else {
    CMU_ClockEnable(cmuClock_EM01GRPACLK, true);
    CMU_ClockSelectSet(handle->uartClock, cmuSelect_EM01GRPACLK);
  }

#if defined(EUART_COUNT) && (EUART_COUNT > 0)
  GPIO->EUARTROUTE->ROUTEEN = GPIO_EUART_ROUTEEN_TXPEN;
  GPIO->EUARTROUTE->TXROUTE = (initData->txPort
                               << _GPIO_EUART_TXROUTE_PORT_SHIFT)
                              | (initData->txPin << _GPIO_USART_TXROUTE_PIN_SHIFT);
  GPIO->EUARTROUTE->RXROUTE = (initData->rxPort
                               << _GPIO_EUART_RXROUTE_PORT_SHIFT)
                              | (initData->rxPin << _GPIO_EUART_RXROUTE_PIN_SHIFT);
#endif

  if ((retVal = SetupGpioEuart(handle, initData)) != ECODE_EMDRV_UARTDRV_OK) {
    return retVal;
  }
  if ((retVal = ConfigGpio(handle, true)) != ECODE_EMDRV_UARTDRV_OK) {
    return retVal;
  }

